# Multi Indexing (Coklu Indeks)

In [76]:
import numpy as np

In [77]:
import pandas as pd

In [78]:
arr = np.random.rand(3, 4)

In [79]:
arr

array([[0.96474901, 0.50695015, 0.38489957, 0.98847231],
       [0.71582966, 0.63816243, 0.15983298, 0.59608699],
       [0.42510367, 0.82564773, 0.67738472, 0.19350024]])

In [80]:
arr = pd.DataFrame(data=arr, index=['Ali', 'Ayşe', 'Osman'], columns=['Yas', 'Gelir', 'Boy', 'Maas'])

In [81]:
arr

            Yas     Gelir       Boy      Maas
Ali    0.964749  0.506950  0.384900  0.988472
Ayşe   0.715830  0.638162  0.159833  0.596087
Osman  0.425104  0.825648  0.677385  0.193500

In [82]:
yeniIndex = ['Al', 2, 3]

In [83]:
arr['Yeni Index'] = yeniIndex

In [84]:
arr

            Yas     Gelir       Boy      Maas Yeni Index
Ali    0.964749  0.506950  0.384900  0.988472         Al
Ayşe   0.715830  0.638162  0.159833  0.596087          2
Osman  0.425104  0.825648  0.677385  0.193500          3

In [85]:
arr.set_index('Yeni Index')

                 Yas     Gelir       Boy      Maas
Yeni Index
Al          0.964749  0.506950  0.384900  0.988472
2           0.715830  0.638162  0.159833  0.596087
3           0.425104  0.825648  0.677385  0.193500

In [86]:
arr

            Yas     Gelir       Boy      Maas Yeni Index
Ali    0.964749  0.506950  0.384900  0.988472         Al
Ayşe   0.715830  0.638162  0.159833  0.596087          2
Osman  0.425104  0.825648  0.677385  0.193500          3

### Belirli Columdaki degerleri gruplayalim;

In [87]:
firstIndex = ['Simpson', 'Simpson', 'Simpson', 'Sout Park', 'Sout Park', 'Sout Park']

In [88]:
secondIndex = ['Homer', 'Bart', 'Marge', 'Cartman', 'Kenny', 'Kyle']

#### yukaridaki 2 listeyi zip() ile birlestirdik

In [89]:
birlesmisIndex = list(zip(firstIndex, secondIndex))

In [90]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('Sout Park', 'Cartman'),
 ('Sout Park', 'Kenny'),
 ('Sout Park', 'Kyle')]

### Simpson olanlari tek tip, Sout Park olanlari tek tip sekilde gorunmesi icin MultiIndex.from_tuples fonksiyonunu kullandik,

#### Eger birlesmisIndex listesi tuple olmasaydi baska veri tipini kullanacaktik!!!

In [91]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [92]:
birlesmisIndex

MultiIndex([(  'Simpson',   'Homer'),
            (  'Simpson',    'Bart'),
            (  'Simpson',   'Marge'),
            ('Sout Park', 'Cartman'),
            ('Sout Park',   'Kenny'),
            ('Sout Park',    'Kyle')],
           )

Alt Satirda Tablomuza ek olarak ekleyecegimiz diger verileri liste halinde girdik.

In [93]:
cizgiFilmListe = [[40,'A'], [10,'B'], [30,'C'], [9,'D'], [10,'E'], [11,'F']]

In [94]:
cizgiFilmListe

[[40, 'A'], [10, 'B'], [30, 'C'], [9, 'D'], [10, 'E'], [11, 'F']]

Alt satirda bu listeyi Numpy Array'ine cevirdik

In [95]:
cizgiFilmNumpyListe = np.array(cizgiFilmListe)

In [96]:
cizgiFilmNumpyListe

array([['40', 'A'],
       ['10', 'B'],
       ['30', 'C'],
       ['9', 'D'],
       ['10', 'E'],
       ['11', 'F']], dtype='<U11')

#### Data Frame islemi

In [97]:
cizgiFilmDataFrame = pd.DataFrame(data=cizgiFilmNumpyListe, index=birlesmisIndex, columns=['Yas', 'Meslek'])

In [98]:
cizgiFilmDataFrame

                  Yas Meslek
Simpson   Homer    40      A
          Bart     10      B
          Marge    30      C
Sout Park Cartman   9      D
          Kenny    10      E
          Kyle     11      F

## Simdide Index girerek bazi verilere ulasmaya calisalim;

In [99]:
cizgiFilmDataFrame.loc['Simpson']

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [100]:
cizgiFilmDataFrame.loc['Sout Park'].loc['Kyle']

Yas       11
Meslek     F
Name: Kyle, dtype: object

### Alt satirda 0. ve 1. index'in tag'lari yok. Buna tag vermeye calisalim;

In [101]:
cizgiFilmDataFrame

                  Yas Meslek
Simpson   Homer    40      A
          Bart     10      B
          Marge    30      C
Sout Park Cartman   9      D
          Kenny    10      E
          Kyle     11      F

In [102]:
cizgiFilmDataFrame.index.names = ['Film Adi', 'Isim']

In [103]:
cizgiFilmDataFrame

                  Yas Meslek
Film Adi  Isim
Simpson   Homer    40      A
          Bart     10      B
          Marge    30      C
Sout Park Cartman   9      D
          Kenny    10      E
          Kyle     11      F